17_init-edit.el
(defun uniq-region ()
   "remove duplicate adjacent lines in the given region"
   (interactive)
   (save-excursion
     (save-restriction
       (narrow-to-region (region-beginning) (region-end))
       (strip-trailing-whitespace (point-min) (point-max))
       (let (( contents (s-split "\n" (buffer-substring-no-properties (point-min) (point-max))))
             ( unified nil)
             )
         (dolist (it contents (setf unified  (reverse  unified)))
           (if (not  (member it unified))
               (setf unified (cons it unified) )))
         (delete-region (point-min) (point-max))
         (insert (s-join "\n" unified))))))


          
 (defun uniquify-region ()
   "remove duplicate adjacent lines in the given region"
   (interactive)
   (save-excursion
     (save-restriction
       (narrow-to-region (region-beginning) (region-end))
       (sort-lines nil (point-min) (point-max))
       (beginning-of-buffer)
       (while (re-search-forward "\\(.*\n\\)\\1+" nil t)
         (replace-match "\\1" nil nil))
       (widen) 
       nil)))

 (defun find-duplicate-lines (&optional insertp interp)
   (interactive "i\np")
   (let ((max-pon (line-number-at-pos (point-max)))
         (gather-dups))
     (while (< (line-number-at-pos) max-pon) (= (forward-line) 0)
            (let ((this-line (buffer-substring-no-properties (line-beginning-position 1) (line-end-position 1)))
                  (next-line (buffer-substring-no-properties (line-beginning-position 2) (line-end-position 2))))
              (when  (equal this-line next-line)  (setq gather-dups (cons this-line gather-dups)))))
     (if (or insertp interp)
         (save-excursion  (princ gather-dups (current-buffer)))
       gather-dups)))

 (defun occur-duplicate-lines ()
   (interactive)
   (occur "\\(.*\n\\)\\1+"))


;; 중복 라인을 제거한다. 
(defun uniquify-all-lines-region (start end)
  "Find duplicate lines in region START to END keeping first occurrence."
  (interactive "*r")
  (save-excursion
    (let ((end (copy-marker end)))
      (while
          (progn
            (goto-char start)
            (re-search-forward "^\\(.*\\)\n\\(\\(.*\n\\)*\\)\\1\n" end t))
        (replace-match "\\1\n\\2")))))

;; Useful function:
;; convert dos (^M) end of line to unix end of line
;; DOS CR-LF
;; UNIX LF


(defun dos2unix ()
  (interactive)
  (set-buffer-file-coding-system 'undecided-unix)
  (goto-char (point-min))
  (while (search-forward-regexp "$" nil t) 
    (replace-match "")))


;versa vice
(defun unix2dos ()
  (interactive)
  (set-buffer-file-coding-system 'undecided-dos)
  (goto-char (point-min))
  (while (search-forward-regexp "$" nil t)
    (replace-match "")))

;; REGISTER 관련 
(defun copy-to-register-1 ()
  "Copy current line or text selection to register 1.
See also: `paste-from-register-1', `copy-to-register'."
  (interactive)
  (let* (
         (bds (get-selection-or-unit 'line ))
         (inputStr (elt bds 0) )
         (p1 (elt bds 1) )
         (p2 (elt bds 2) )
         )
    (copy-to-register ?1 p1 p2)
    (message "copied to register 1: 「%s」." inputStr)
))

(defun paste-from-register-1 ()
  "Paste text from register 1.
See also: `copy-to-register-1', `insert-register'."
  (interactive)
  (insert-register ?1))

(defun insert-a ()
  (interactive)
  (save-excursion  (yank))
  (insert-register ?a))

;;deprecated;; ;;; javascript indent 
;;deprecated;; (defun my-js2-indent-function ()
;;deprecated;;   (interactive)
;;deprecated;;   (save-restriction
;;deprecated;;     (widen)
;;deprecated;;     (let* ((inhibit-point-motion-hooks t)
;;deprecated;;            (parse-status (save-excursion (syntax-ppss (point-at-bol))))
;;deprecated;;            (offset (- (current-column) (current-indentation)))
;;deprecated;;            (indentation (js--proper-indentation parse-status))
;;deprecated;;            node)
;;deprecated;; 
;;deprecated;;       (save-excursion
;;deprecated;; 
;;deprecated;;         (back-to-indentation)
;;deprecated;;         ;; consecutive declarations in a var statement are nice if
;;deprecated;;         ;; properly aligned, i.e:
;;deprecated;;         ;;
;;deprecated;;         ;; var foo = "bar",
;;deprecated;;         ;;     bar = "foo";
;;deprecated;;         (setq node (js2-node-at-point))
;;deprecated;;         (when (and node
;;deprecated;;                    (= js2-NAME (js2-node-type node))
;;deprecated;;                    (= js2-VAR (js2-node-type (js2-node-parent node))))
;;deprecated;;           (setq indentation ( 4 indentation))))
;;deprecated;; 
;;deprecated;;       (indent-line-to indentation)
;;deprecated;;       (when (> offset 0) (forward-char offset)))))
;;deprecated;; 
;;deprecated;; (defun my-indent-sexp ()
;;deprecated;;   (interactive)
;;deprecated;;   (save-restriction
;;deprecated;;     (save-excursion
;;deprecated;;       (widen)
;;deprecated;;       (let* ((inhibit-point-motion-hooks t)
;;deprecated;;              (parse-status (syntax-ppss (point)))
;;deprecated;;              (beg (nth 1 parse-status))
;;deprecated;;              (end-marker (make-marker))
;;deprecated;;              (end (progn (goto-char beg) (forward-list) (point)))
;;deprecated;;              (ovl (make-overlay beg end)))
;;deprecated;;         (set-marker end-marker end)
;;deprecated;;         (overlay-put ovl 'face 'highlight)
;;deprecated;;         (goto-char beg)
;;deprecated;;         (while (< (point) (marker-position end-marker))
;;deprecated;;           ;; don't reindent blank lines so we don't set the "buffer
;;deprecated;;           ;; modified" property for nothing
;;deprecated;;           (beginning-of-line)
;;deprecated;;           (unless (looking-at "\\s-*$")
;;deprecated;;             (indent-according-to-mode))
;;deprecated;;           (forward-line))
;;deprecated;;         (run-with-timer 0.5 nil '(lambda(ovl)
;;deprecated;;                                    (delete-overlay ovl)) ovl)))))
;;deprecated;; 
;;deprecated;; (defun my-js2-mode-hook ()
;;deprecated;;   (require 'js)
;;deprecated;;   (setq js-indent-level 2
;;deprecated;;         indent-tabs-mode nil
;;deprecated;;         c-basic-offset 2)
;;deprecated;;   (c-toggle-auto-state 0)
;;deprecated;;   (c-toggle-hungry-state 1)
;;deprecated;;   (set (make-local-variable 'indent-line-function) 'my-js2-indent-function)
;;deprecated;;   (define-key js2-mode-map [(meta control |)] 'cperl-lineup)
;;deprecated;;   (define-key js2-mode-map [(meta control \;)] 
;;deprecated;;     '(lambda()
;;deprecated;;        (interactive)
;;deprecated;;        (insert "/* -----[ ")
;;deprecated;;        (save-excursion
;;deprecated;;          (insert " ]----- */"))
;;deprecated;;        ))
;;deprecated;;   (define-key js2-mode-map [(return)] 'newline-and-indent)
;;deprecated;;   (define-key js2-mode-map [(backspace)] 'c-electric-backspace)
;;deprecated;;   (define-key js2-mode-map [(control d)] 'c-electric-delete-forward)
;;deprecated;;   (define-key js2-mode-map [(control meta q)] 'my-indent-sexp)
;;deprecated;;   (if (featurep 'js2-highlight-vars)
;;deprecated;;     (js2-highlight-vars-mode))
;;deprecated;;   (message "My JS2 hook"))
;;deprecated;; 
;;deprecated;; (add-hook 'js2-mode-hook 'my-js2-mode-hook)
