17_init-edit.el

(defun upcase-symbol (syms)
  (interactive)
  (mapcar 
   (lambda (x)
     (replace-string 
      (symbol-name x )
      (upcase (symbol-name x )) t (point-min) (point-max )))
   syms ))



(defun strip-trailing-whitespace (b e )
  "strips whitespace from the end of all the lines in the buffer;
equivalent to (`replace-regexp' \" \\t+$\" \"\")"
  (interactive "r")
  (save-excursion
    (save-restriction
      (narrow-to-region b e)
      (goto-char (point-min))
      (while (re-search-forward "[ \t]+$" nil t) (replace-match "" nil t)) 
      nil)))

;; 다음을 이용하여 한 단어를 capitalize 할 수 있다. 
(defun ucap ( )
  (interactive)
  (let ((start (point))
        (end (progn (forward-sexp) (point))))
    (replace-string "_" " " nil start end )
    (capitalize-region start end )
    (replace-string " " "" nil start end )))

(defun swap-regions (beg1 end1 beg2 end2)
  "Swap region between BEG1 and END1 with region BEG2 and END2.

For the first region, mark the first region and set mark at
point.  The second region only needs to be marked normally.
Again, set the mark at the beginning and end of the first region,
then mark the second region with mark and point.

The order of the two regions in the buffer doesn't matter.
Either one can precede the other.  However, the regions can not
be swapped if they overlap.

All arguments can either be a number for a position in the buffer
or a marker."
  (interactive
   (if (< (length mark-ring) 2)
       (error "Not enough in mark-ring to swap a region")
     (let ((region (list (region-beginning) (region-end)))
           (marks (sort (list (marker-position (car mark-ring))
                              (marker-position (cadr mark-ring)))
                        '<)))
       (if (< (car region) (car marks))
           (append region marks)
         (append marks region)))))
  (if (or (and (< beg2 beg1) (< beg1 end2))
          (and (< beg1 beg2) (< beg2 end1)))
      (error "Unable to swap overlapping regions")
    (save-excursion
      (insert 
       (prog1 (delete-and-extract-region beg2 end2)
         (goto-char beg2)
         (insert 
          (delete-and-extract-region beg1 end1))
         (goto-char beg1))))))

(defun swap-text (str1 str2 beg end)
  "Changes all STR1 to STR2 and all STR2 to STR1 in beg/end region."
  (interactive "sString A: \nsString B: \nr")
  (if mark-active
      (setq deactivate-mark t)
    (setq beg (point-min) end (point-max))) 
  (goto-char beg)
  (while (re-search-forward
    (concat "\\(?:\\b\\(" (regexp-quote str1) "\\)\\|\\("
      (regexp-quote str2) "\\)\\b\\)") end t)
    (if (match-string 1)
  (replace-match str2 t t)
      (replace-match str1 t t))))

(defun forward-delete ( &optional x)
  (interactive "p")
  (or x (setf x 1 ))
  (forward-sexp x )
  (kill-line)
  (next-line)
  (move-beginning-of-line nil))


(defun switch-equal (begin end )
  (interactive "r" )
  (replace-regexp " *\\(.*\\) *= *\\(.*\\) *;" "\\2 = \\1 ;" nil begin end ))

(defun dongif (beg end)
  "Changes all STR1 to STR2 and all STR2 to STR1 in beg/end region."
  (interactive "r")
  (if mark-active
      (setq deactivate-mark t)
    (setq beg (point-min) end (point-max))) 
  (replace-regexp " *\\([0-9a-zA-Z_]+\\) * \\([=!]\\)= *\\([0-9a-zA-Z_]+\\) *" "\\3 \\2=\\1" nil beg end ))

;;;
;;;
;;; ※ 변수 설정
;;;
;;;
(setq tab-stop-list 
      '(2 4 8 12 16 20 24 28 32 36 40 44 48 52 56 60 64 68 72 ))
;; 탭을 공백으로 만들 수 있다. 
(setq-default indent-tabs-mode nil )
(setq-default tab-width 2 )

(defun make-buffer-readonly () (read-only-mode 1 ))

(defun global-read-only ( &optional v)
  (interactive
   (list (prefix-numeric-value current-prefix-arg) ))
  (if (= 1 v)
      (progn 
        (remove-hook 'find-file-hook #'make-buffer-readonly)
        (add-hook 'find-file-hook #'make-buffer-readonly))
    (remove-hook 'find-file-hook #'make-buffer-readonly)))

;;SDD;;(defun ib () (interactive)  (insert "default : break; "))
;;SDD;;(defun sdd () (interactive) (insert ( format "//@@@ " )) (kill-new "//@@@\n"))
;;SDD;;
;;SDD;;(global-set-key [f12] 'sdd )
;;SDD;;
;;SDD;;(defun ifsdd () 
;;SDD;;  (interactive) 
;;SDD;;  (insert "
;;SDD;;  //@@@ if( ){
;;SDD;;  //@@@   return ; 
;;SDD;;  //@@@ }
;;SDD;;"))
;;SDD;;
;;SDD;;(global-set-key [f11] 'ifsdd )

(defun sdd-cmt (start end )
 (interactive "r ")
 (let ((proto (buffer-substring-no-properties start end) ))
  (insert (string-replace-match "[(),]" proto " " t t ))))

(defun sdd-header (start end )
 (interactive "r ")
 (hl-line-mode t )
 (save-excursion
   (save-restriction
     (narrow-to-region start end)
     (replace-string ";" "; //@@@ " nil (point-min) (point-max))
     (set-middle (point-min) (point-max) "//@@@")
     (widen))))

(defun sdd-single ()
 (interactive )
 (insert "//@@@ 클래스의 유일한 인스턴스를 리턴하는 클래스함수 "))

(defun insert-function-table ()
  (interactive)
  (insert "<함수테이블> <내용>" ))

(defun insert-cross-reference ()
  (interactive)
  (insert "# #" ) (backward-char 1))

(defun insert-cdata ()
  (interactive)
  (insert " <![CDATA[]]>" ))

(global-set-key "\C-ct" 'insert-function-table )
(global-set-key "\C-cj" 'insert-cross-reference )


(defun xmltable ()
  (interactive)
  (replace-string "기능 " "")
  (beginning-of-buffer)
  (replace-string "함수명 " "")
  (beginning-of-buffer)
  (replace-string "입력 " "")
  (beginning-of-buffer)
  (replace-string "출력 " "")
  (beginning-of-buffer)
  (replace-string "예외 처리
" "")
  (beginning-of-buffer)
  (replace-string "처리
" "")
  (beginning-of-buffer)
  (replace-string "비고
" ""))

(defun backward-symbol (arg)
  (interactive "p")
  (forward-symbol (* -1 arg )))

(defun toggle-line-move-visual ()
  "Toggle behavior of up/down arrow key, by visual line vs logical line."
  (interactive)
  (if line-move-visual
      (setq line-move-visual nil)
    (setq line-move-visual t))
  )

(use-package expand-region)

(require 'misc-cmds)
(global-set-key (kbd "<home>") 'beginning-or-indentation)

(use-package delsel
  :config
  (delete-selection-mode 1))

(use-package hide-region+
  :commands hide-region-hide hide-region-unhide)

(defun byte-compile-current-buffer ()
  "`byte-compile' current buffer if it's emacs-lisp-mode and compiled file exists."
  (interactive)
  (when (and (eq major-mode 'emacs-lisp-mode)
             (file-exists-p (byte-compile-dest-file buffer-file-name)))
    (byte-compile-file buffer-file-name)))

;;;_ REVERT BUFFER http://www.emacswiki.org/emacs/RevertBuffer
(global-auto-revert-mode 1)
